lighttransport/gemm/cpu/sam3d/sam3d_runner.c
/* sam3d_runner.c — v1 CPU runner for SAM-3D-Objects. */

#include "sam3d_runner.h"

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#define GGML_DEQUANT_IMPLEMENTATION
#include "ggml_dequant.h"

#define SAFETENSORS_IMPLEMENTATION
#include "safetensors.h"

#define DINOV2_IMPLEMENTATION
#include "dinov2.h"

#define SAM3D_COND_FUSER_IMPLEMENTATION
#include "sam3d_cond_fuser.h"

#define SAM3D_SS_FLOW_DIT_IMPLEMENTATION
#include "sam3d_ss_flow_dit.h"

#define SPARSE3D_IMPLEMENTATION
#include "sparse3d.h"

#define SAM3D_GS_DECODER_IMPLEMENTATION
#include "sam3d_gs_decoder.h"

#define SAM3D_SLAT_DIT_IMPLEMENTATION
#include "sam3d_slat_dit.h"

#define T2_SS_DEC_IMPLEMENTATION
#include "trellis2_ss_decoder.h"

#include "sam3d_shortcut_solver.h"

#define SAM3D_E_NOT_IMPLEMENTED (-2)

typedef struct {
    float *data;
    int    n, c;
} f32_2d;

typedef struct {
    float *data;
    int    dims[4];
    int    ndim;
} f32_nd;

typedef struct {
    float   *feats;
    int32_t *coords;  /* [n, 4] */
    int      n, c;
} slat_buf;

struct sam3d_ctx {
    sam3d_config cfg;

    /* Resolved safetensors directory (cfg.safetensors_dir or inferred
     * from pipeline_yaml's parent dir). */
    char sft_dir[1024];

    /* Lazily-loaded submodules. */
    dinov2_model            *dinov2;
    sam3d_ppe_model         *ppe;
    sam3d_fuser_model       *fuser;
    sam3d_ss_flow_dit_model *ss_dit;
    t2_ss_dec               *ss_dec;
    sam3d_slat_dit_model    *slat_dit;
    sam3d_gs_decoder_model  *gs_decoder;

    /* Inputs. */
    uint8_t *rgba;      int   rgba_w, rgba_h;
    uint8_t *mask;      int   mask_w, mask_h;
    float   *pointmap;  int   pmap_w, pmap_h;

    /* Stage outputs. */
    f32_2d dinov2_tokens;   /* [2 * (1+n_patches), dim] — image + mask branch,
                             * register tokens dropped (Dino.forward parity) */
    f32_2d cond_tokens;     /* fuser output */
    f32_nd ss_latent;       /* [8, 16, 16, 16] */
    f32_nd occupancy;       /* [64, 64, 64] */
    slat_buf slat;
    f32_2d gaussians;       /* [n, 17] */
};

static void f32_2d_free(f32_2d *b) { free(b->data); b->data = NULL; b->n = b->c = 0; }
static void f32_nd_free(f32_nd *b) { free(b->data); b->data = NULL; b->ndim = 0; }
static void slat_free(slat_buf *b) {
    free(b->feats); free(b->coords);
    b->feats = NULL; b->coords = NULL; b->n = b->c = 0;
}

sam3d_ctx *sam3d_create(const sam3d_config *cfg)
{
    if (!cfg || !cfg->pipeline_yaml) return NULL;
    sam3d_ctx *c = (sam3d_ctx *)calloc(1, sizeof(*c));
    if (!c) return NULL;
    c->cfg = *cfg;
    /* Defaults from the shipped checkpoints' yaml: SS DiT is a
     * shortcut ODE (2 steps); SLAT DiT is standard flow-matching
     * (12 steps); SS cfg_strength on shape modality is 2.0
     * (SLAT cfg_strength is 0). */
    if (c->cfg.ss_steps   <= 0) c->cfg.ss_steps   = 2;
    if (c->cfg.slat_steps <= 0) c->cfg.slat_steps = 12;
    if (c->cfg.cfg_scale  <= 0) c->cfg.cfg_scale  = 2.0f;
    if (c->cfg.n_threads  <= 0) {
        const char *env = getenv("OMP_NUM_THREADS");
        c->cfg.n_threads = env ? atoi(env) : 1;
        if (c->cfg.n_threads < 1) c->cfg.n_threads = 1;
    }

    /* Resolve per-module safetensors directory. */
    if (cfg->safetensors_dir && cfg->safetensors_dir[0]) {
        snprintf(c->sft_dir, sizeof(c->sft_dir), "%s", cfg->safetensors_dir);
    } else {
        /* Fall back to siblingof(pipeline_yaml's dir)/safetensors/. */
        const char *slash = strrchr(cfg->pipeline_yaml, '/');
        if (slash) {
            size_t len = (size_t)(slash - cfg->pipeline_yaml);
            if (len >= sizeof(c->sft_dir)) len = sizeof(c->sft_dir) - 32;
            memcpy(c->sft_dir, cfg->pipeline_yaml, len);
            c->sft_dir[len] = '\0';
            /* sibling: strip trailing "/checkpoints" if present. */
            char *tail = strrchr(c->sft_dir, '/');
            if (tail && strcmp(tail, "/checkpoints") == 0) *tail = '\0';
            size_t cur = strlen(c->sft_dir);
            snprintf(c->sft_dir + cur, sizeof(c->sft_dir) - cur, "/safetensors");
        } else {
            snprintf(c->sft_dir, sizeof(c->sft_dir), "./safetensors");
        }
    }

    if (c->cfg.verbose) {
        fprintf(stderr, "[sam3d] create: pipeline_yaml=%s seed=%llu "
                        "ss_steps=%d slat_steps=%d cfg=%.1f threads=%d\n",
                cfg->pipeline_yaml, (unsigned long long)cfg->seed,
                c->cfg.ss_steps, c->cfg.slat_steps, c->cfg.cfg_scale,
                c->cfg.n_threads);
        fprintf(stderr, "[sam3d] safetensors_dir=%s\n", c->sft_dir);
    }
    return c;
}

const char *sam3d_safetensors_dir(const sam3d_ctx *ctx)
{
    return ctx ? ctx->sft_dir : NULL;
}

void sam3d_destroy(sam3d_ctx *ctx)
{
    if (!ctx) return;
    if (ctx->dinov2) dinov2_free(ctx->dinov2);
    if (ctx->ppe)    sam3d_ppe_free(ctx->ppe);
    if (ctx->fuser)  sam3d_fuser_free(ctx->fuser);
    if (ctx->ss_dit) sam3d_ss_flow_dit_free(ctx->ss_dit);
    if (ctx->ss_dec) t2_ss_dec_free(ctx->ss_dec);
    if (ctx->slat_dit) sam3d_slat_dit_free(ctx->slat_dit);
    if (ctx->gs_decoder) sam3d_gs_decoder_free(ctx->gs_decoder);
    free(ctx->rgba); free(ctx->mask); free(ctx->pointmap);
    f32_2d_free(&ctx->dinov2_tokens);
    f32_2d_free(&ctx->cond_tokens);
    f32_nd_free(&ctx->ss_latent);
    f32_nd_free(&ctx->occupancy);
    slat_free(&ctx->slat);
    f32_2d_free(&ctx->gaussians);
    free(ctx);
}

static int dup_buf_u8(uint8_t **dst, int *dw, int *dh,
                      const uint8_t *src, int w, int h, int ch)
{
    free(*dst);
    size_t n = (size_t)w * h * ch;
    *dst = (uint8_t *)malloc(n);
    if (!*dst) return -1;
    memcpy(*dst, src, n);
    *dw = w; *dh = h;
    return 0;
}

int sam3d_set_image_rgba(sam3d_ctx *ctx, const uint8_t *rgba, int w, int h)
{
    if (!ctx || !rgba || w <= 0 || h <= 0) return -1;
    return dup_buf_u8(&ctx->rgba, &ctx->rgba_w, &ctx->rgba_h, rgba, w, h, 4);
}

int sam3d_set_mask(sam3d_ctx *ctx, const uint8_t *mask, int w, int h)
{
    if (!ctx || !mask || w <= 0 || h <= 0) return -1;
    return dup_buf_u8(&ctx->mask, &ctx->mask_w, &ctx->mask_h, mask, w, h, 1);
}

