lighttransport/gemm/cpu/sam3d/sam3d_runner.c
int sam3d_set_pointmap(sam3d_ctx *ctx, const float *pmap, int w, int h)
{
    if (!ctx || !pmap || w <= 0 || h <= 0) return -1;
    free(ctx->pointmap);
    size_t n = (size_t)w * h * 3;
    ctx->pointmap = (float *)malloc(n * sizeof(float));
    if (!ctx->pointmap) return -1;
    memcpy(ctx->pointmap, pmap, n * sizeof(float));
    ctx->pmap_w = w; ctx->pmap_h = h;
    return 0;
}

/* ---- Stage entrypoints ---- */

static int f32_2d_alloc(f32_2d *b, int n, int c) {
    free(b->data);
    b->data = (float *)malloc((size_t)n * c * sizeof(float));
    if (!b->data) return -1;
    b->n = n; b->c = c;
    return 0;
}

/* Preprocess a 1-channel mask → normalized fp32 CHW at [3 × oh × ow]
 * as a binary-mask-replicated-to-3-channels and ImageNet-normalized,
 * matching the pytorch `rgb_image_mask = (alpha > 0).float()` path
 * followed by DINOv2's 1→3 channel repeat and (x - mean) / std.
 * pad_to_square_centered + nearest-neighbor Resize to (oh, ow).
 * Caller allocates out_chw as 3*oh*ow floats. */
static void sam3d_prep_mask_branch_f32(float *out_chw,
                                       const uint8_t *mask, int mw, int mh,
                                       int ow, int oh,
                                       const float mean[3],
                                       const float std[3])
{
    int s = (mw > mh) ? mw : mh;
    int ox = (s - mw) / 2;
    int oy = (s - mh) / 2;
    float scale_y = (float)s / (float)oh;
    float scale_x = (float)s / (float)ow;
    /* Pytorch F.interpolate mode="nearest" (legacy/backward-compat):
     * src_idx = floor(dst_idx * src / dst). NOT the centered variant.
     * my/mx clamp to [0, s-1] is unneeded: y<oh and scale_y=s/oh give
     * my<s; non-negativity is guaranteed by y>=0. */
#if defined(_OPENMP)
    #pragma omp parallel for schedule(static)
#endif
    for (int y = 0; y < oh; y++) {
        int my_src = (int)floorf((float)y * scale_y) - oy;
        for (int x = 0; x < ow; x++) {
            int mx_src = (int)floorf((float)x * scale_x) - ox;
            float v = 0.0f;
            if (my_src >= 0 && my_src < mh && mx_src >= 0 && mx_src < mw)
                v = (mask[my_src * mw + mx_src] > 0) ? 1.0f : 0.0f;
            for (int c = 0; c < 3; c++) {
                out_chw[c * oh * ow + y * ow + x] = (v - mean[c]) / std[c];
            }
        }
    }
}

/* Preprocess RGBA → normalized fp32 CHW at [3 × oh × ow]. Matches the
 * pytorch ss_preprocessor "full" branch: pad_to_square_centered →
 * bilinear Resize(ow) → div 255 → (x - mean) / std. align_corners=False
 * matches F.interpolate. Caller allocates out_chw as 3*oh*ow floats. */
static void sam3d_prep_rgb_branch_f32(float *out_chw,
                                      const uint8_t *rgba, int iw, int ih,
                                      int ow, int oh,
                                      const float mean[3], const float std[3])
{
    int s = (iw > ih) ? iw : ih;
    int ox = (s - iw) / 2;
    int oy = (s - ih) / 2;
    float scale_y = (float)s / (float)oh;
    float scale_x = (float)s / (float)ow;

#if defined(_OPENMP)
    #pragma omp parallel for schedule(static)
#endif
    for (int y = 0; y < oh; y++) {
        float fy = ((float)y + 0.5f) * scale_y - 0.5f;
        int y0 = (int)floorf(fy);
        int y1 = y0 + 1;
        float dy = fy - (float)y0;
        int y0s = y0 - oy, y1s = y1 - oy;

        for (int x = 0; x < ow; x++) {
            float fx = ((float)x + 0.5f) * scale_x - 0.5f;
            int x0 = (int)floorf(fx);
            int x1 = x0 + 1;
            float dx = fx - (float)x0;
            int x0s = x0 - ox, x1s = x1 - ox;

            for (int c = 0; c < 3; c++) {
                float a00 = 0.f, a01 = 0.f, a10 = 0.f, a11 = 0.f;
                if (y0s >= 0 && y0s < ih) {
                    if (x0s >= 0 && x0s < iw)
                        a00 = (float)rgba[(y0s * iw + x0s) * 4 + c];
                    if (x1s >= 0 && x1s < iw)
                        a01 = (float)rgba[(y0s * iw + x1s) * 4 + c];
                }
                if (y1s >= 0 && y1s < ih) {
                    if (x0s >= 0 && x0s < iw)
                        a10 = (float)rgba[(y1s * iw + x0s) * 4 + c];
                    if (x1s >= 0 && x1s < iw)
                        a11 = (float)rgba[(y1s * iw + x1s) * 4 + c];
                }
                float v = a00 * (1 - dy) * (1 - dx)
                        + a01 * (1 - dy) * dx
                        + a10 * dy       * (1 - dx)
                        + a11 * dy       * dx;
                v /= 255.0f;
                out_chw[c * oh * ow + y * ow + x] = (v - mean[c]) / std[c];
            }
        }
    }
}

int sam3d_run_dinov2(sam3d_ctx *ctx)
{
    if (!ctx || !ctx->rgba) return -1;

    /* Lazy-load. */
    if (!ctx->dinov2) {
        char path[1200];
        snprintf(path, sizeof(path), "%s/sam3d_dinov2.safetensors", ctx->sft_dir);
        ctx->dinov2 = dinov2_load_safetensors(path);
        if (!ctx->dinov2) {
            fprintf(stderr, "[sam3d] dinov2: failed to load %s\n", path);
            return -3;
        }
    }

    int img_sz = ctx->dinov2->image_size;   /* 518 */
    int n_reg  = ctx->dinov2->n_register;   /* 4 */
    int dim    = ctx->dinov2->dim;          /* 1024 */
    int nthr   = ctx->cfg.n_threads;

    /* Image branch: pad_to_square_centered → bilinear resize → ImageNet
     * normalization, all in fp32 to avoid uint8 quantization drift
     * amplified through 24 transformer blocks. */
    float *chw_img = (float *)malloc((size_t)3 * img_sz * img_sz * sizeof(float));
    if (!chw_img) return -5;
    sam3d_prep_rgb_branch_f32(chw_img, ctx->rgba, ctx->rgba_w, ctx->rgba_h,
                              img_sz, img_sz,
                              ctx->dinov2->image_mean, ctx->dinov2->image_std);
    dinov2_result r_img = dinov2_encode_f32(ctx->dinov2, chw_img, img_sz, img_sz, nthr);
    free(chw_img);
    if (!r_img.features) return -4;
    dinov2_result_drop_registers(&r_img, n_reg);

    /* Mask branch: binary mask broadcast to 3 channels, then same
     * pad_to_square + resize + ImageNet-norm path. pytorch's DINOv2
     * wrapper does the 1→3 broadcast internally; we do it here so the
     * downstream encoder path is identical for both branches. */
    dinov2_result r_msk = {0};
    if (ctx->mask) {
        float *chw_msk = (float *)malloc((size_t)3 * img_sz * img_sz * sizeof(float));
        if (!chw_msk) { dinov2_result_free(&r_img); return -5; }
        sam3d_prep_mask_branch_f32(chw_msk, ctx->mask, ctx->mask_w, ctx->mask_h,
                                   img_sz, img_sz,
                                   ctx->dinov2->image_mean, ctx->dinov2->image_std);
        r_msk = dinov2_encode_f32(ctx->dinov2, chw_msk, img_sz, img_sz, nthr);
        free(chw_msk);
        if (!r_msk.features) { dinov2_result_free(&r_img); return -4; }
        dinov2_result_drop_registers(&r_msk, n_reg);
    }

    /* Concatenate image + mask tokens along the token axis. */
    int n_tok  = r_img.n_tokens;            /* 1 + n_patches after drop */
    int n_branches = r_msk.features ? 2 : 1;
    int n_total = n_branches * n_tok;
    if (f32_2d_alloc(&ctx->dinov2_tokens, n_total, dim) != 0) {
        dinov2_result_free(&r_img); dinov2_result_free(&r_msk);
        return -5;
    }
    memcpy(ctx->dinov2_tokens.data, r_img.features,
           (size_t)n_tok * dim * sizeof(float));
    if (r_msk.features) {
        memcpy(ctx->dinov2_tokens.data + (size_t)n_tok * dim, r_msk.features,
               (size_t)n_tok * dim * sizeof(float));
    }
    dinov2_result_free(&r_img);
    dinov2_result_free(&r_msk);
    return 0;
}
int sam3d_run_cond_fuser(sam3d_ctx *ctx)
{
    if (!ctx) return -1;
    if (!ctx->dinov2_tokens.data) {
        fprintf(stderr, "[sam3d] cond_fuser: dinov2_tokens not set — run "
                        "sam3d_run_dinov2() (or override) first\n");
        return -1;
    }
    int nthr = ctx->cfg.n_threads;

    /* Lazy-load PPE + fuser. */
    if (!ctx->ppe) {
        char path[1200];
        snprintf(path, sizeof(path), "%s/sam3d_point_patch_embed.safetensors",
                 ctx->sft_dir);
        ctx->ppe = sam3d_ppe_load_safetensors(path);
        if (!ctx->ppe) return -3;
    }
    if (!ctx->fuser) {
        char path[1200];
        snprintf(path, sizeof(path), "%s/sam3d_cond_fuser.safetensors",
                 ctx->sft_dir);
        ctx->fuser = sam3d_fuser_load_safetensors(path);
        if (!ctx->fuser) return -3;
    }

    int dim_in  = ctx->dinov2_tokens.c;                 /* 1024 */
    int D_out   = ctx->fuser->embed_dim_out;            /* 1024 */
    int dino_n  = ctx->dinov2_tokens.n;                 /* 2*1370 */
    int branch  = dino_n / 2;                           /* 1370 */

    /* v1 only runs the "full" variants: 1× dino image + 1× dino mask +
     * 1× pointmap. Cropped variants (+ another pass of each modality)
     * are deferred until MoGe / crop preprocessing lands. */
    const int pos = SAM3D_FUSER_POS_FULL;

    float *dino_img = sam3d_fuser_project(ctx->fuser, SAM3D_FUSER_MOD_DINO_IMG,
                                          ctx->dinov2_tokens.data,
                                          branch, nthr);
    if (!dino_img) return -5;
    sam3d_fuser_add_pos(ctx->fuser, pos, dino_img, branch);

    float *dino_msk = sam3d_fuser_project(ctx->fuser, SAM3D_FUSER_MOD_DINO_MSK,
                                          ctx->dinov2_tokens.data
                                              + (size_t)branch * dim_in,
                                          branch, nthr);
    if (!dino_msk) { free(dino_img); return -5; }
    sam3d_fuser_add_pos(ctx->fuser, pos, dino_msk, branch);

    /* Point branch — if no pointmap is available, cond tokens will
     * carry only the two dino branches. */
    float *point = NULL;
    int point_n = 0;
    if (ctx->pointmap) {
        float *ppe_tokens = sam3d_ppe_encode(ctx->ppe, ctx->pointmap,
                                             ctx->pmap_h, ctx->pmap_w,
                                             NULL, nthr);
        if (!ppe_tokens) { free(dino_img); free(dino_msk); return -5; }
        int n_ppe = ctx->ppe->num_patches * ctx->ppe->num_patches;
        point = sam3d_fuser_project(ctx->fuser, SAM3D_FUSER_MOD_POINT,
                                    ppe_tokens, n_ppe, nthr);
        free(ppe_tokens);
        if (!point) { free(dino_img); free(dino_msk); return -5; }
        sam3d_fuser_add_pos(ctx->fuser, pos, point, n_ppe);
        point_n = n_ppe;
    }

    /* Concatenate along the token axis. */
    int n_total = branch * 2 + point_n;
    if (f32_2d_alloc(&ctx->cond_tokens, n_total, D_out) != 0) {
        free(dino_img); free(dino_msk); free(point);
        return -5;
    }
    float *dst = ctx->cond_tokens.data;
    memcpy(dst, dino_img, (size_t)branch * D_out * sizeof(float));
    memcpy(dst + (size_t)branch * D_out, dino_msk,
           (size_t)branch * D_out * sizeof(float));
    if (point) {
        memcpy(dst + (size_t)2 * branch * D_out, point,
               (size_t)point_n * D_out * sizeof(float));
    }
    free(dino_img); free(dino_msk); free(point);
    return 0;
}
/* xorshift64* PRNG + Box-Muller → standard normal. Deterministic per seed. */
static inline uint64_t sam3d_rng_next(uint64_t *state) {
    uint64_t x = *state;
    x ^= x >> 12; x ^= x << 25; x ^= x >> 27;
    *state = x;
    return x * 0x2545F4914F6CDD1DULL;
}
static inline float sam3d_rng_u01(uint64_t *state) {
    uint64_t r = sam3d_rng_next(state) >> 11;
    return (float)((double)r * (1.0 / 9007199254740992.0));
}
static void sam3d_fill_randn(float *buf, int n, uint64_t *state) {
    for (int i = 0; i < n; i += 2) {
        float u1 = sam3d_rng_u01(state); if (u1 < 1e-7f) u1 = 1e-7f;
        float u2 = sam3d_rng_u01(state);
        float r = sqrtf(-2.0f * logf(u1));
        float a = 6.2831853f * u2;
        buf[i] = r * cosf(a);
        if (i + 1 < n) buf[i + 1] = r * sinf(a);
    }
}

static const int sam3d_ss_lat_elts[5] = { 4096 * 8, 1 * 6, 1 * 3, 1 * 3, 1 * 1 };

