lighttransport/gemm/cpu/sam3d/sam3d_runner.c
int sam3d_run_ss_dit(sam3d_ctx *ctx)
{
    if (!ctx) return -1;
    if (!ctx->cond_tokens.data) {
        fprintf(stderr, "[sam3d] ss_dit: cond tokens not set — run "
                        "sam3d_run_cond_fuser() (or override) first\n");
        return -1;
    }
    if (!ctx->ss_dit) {
        char path[1200];
        snprintf(path, sizeof(path), "%s/sam3d_ss_dit.safetensors", ctx->sft_dir);
        ctx->ss_dit = sam3d_ss_flow_dit_load_safetensors(path);
        if (!ctx->ss_dit) {
            fprintf(stderr, "[sam3d] ss_dit: failed to load %s\n", path);
            return -3;
        }
    }
    sam3d_ss_flow_dit_model *m = ctx->ss_dit;
    int nthr = ctx->cfg.n_threads;
    int steps = ctx->cfg.ss_steps;

    /* Allocate one buffer per modality. */
    float *lat[SAM3D_SS_DIT_N_LATENTS] = {0};
    float *vel[SAM3D_SS_DIT_N_LATENTS] = {0};
    float *vel_u[SAM3D_SS_DIT_N_LATENTS] = {0};
    for (int i = 0; i < SAM3D_SS_DIT_N_LATENTS; i++) {
        lat[i] = (float *)malloc((size_t)sam3d_ss_lat_elts[i] * sizeof(float));
        vel[i] = (float *)malloc((size_t)sam3d_ss_lat_elts[i] * sizeof(float));
        vel_u[i] = (float *)malloc((size_t)sam3d_ss_lat_elts[i] * sizeof(float));
        if (!lat[i] || !vel[i] || !vel_u[i]) goto oom;
    }

    /* Seeded Gaussian init. Upstream ShortCut.generate_iter samples from
     * randn at t=1 and denoises toward t=0. */
    uint64_t rng = ctx->cfg.seed ? ctx->cfg.seed : 0x9E3779B97F4A7C15ULL;
    for (int i = 0; i < SAM3D_SS_DIT_N_LATENTS; i++)
        sam3d_fill_randn(lat[i], sam3d_ss_lat_elts[i], &rng);

    /* Upstream pointmap inference runs the shortcut generator with
     * no_shortcut=True and ss_rescale_t=3 unless overridden by the pipeline.
     * That means pure flow matching (d=0), not a shortcut jump. */
    float *times = (float *)malloc((size_t)(steps + 1) * sizeof(float));
    sam3d_shortcut_make_times(times, steps, 3.0f, /*reversed=*/0);
    float d = sam3d_shortcut_d(steps, /*no_shortcut=*/1);

    /* time_scale=1000 from ss_generator.yaml. Upstream `_generate_dynamics`
     * multiplies t,d by time_scale before calling the model; the Euler step
     * stays in caller-visible [0,1] space. The model's TimestepEmbedder was
     * trained on t in [0, 1000] — passing raw t in [0,1] gives a near-zero
     * sinusoidal embedding and yields all-negative occupancy. */
    const float TIME_SCALE = m->time_scale;

    float *zero_cond = NULL;
    if (ctx->cfg.cfg_scale > 0.0f) {
        zero_cond = (float *)calloc((size_t)ctx->cond_tokens.n * ctx->cond_tokens.c,
                                    sizeof(float));
        if (!zero_cond) goto oom;
    }

    int cfg_steps = 0;
    for (int s = 0; s < steps; s++) {
        float t = times[s];
        float dt = times[s + 1] - times[s];
        float ts = t * TIME_SCALE;

        if (sam3d_ss_flow_dit_forward(m,
                                      (const float *const *)lat, vel,
                                      ctx->cond_tokens.data, ctx->cond_tokens.n,
                                      ts, d * TIME_SCALE, nthr) != 0) {
            fprintf(stderr, "[sam3d] ss_dit: forward failed at step %d\n", s);
            free(times); free(zero_cond);
            for (int k = 0; k < SAM3D_SS_DIT_N_LATENTS; k++) {
                free(lat[k]); free(vel[k]); free(vel_u[k]);
            }
            return -4;
        }
        if (zero_cond && sam3d_shortcut_cfg_active(ts, 0.0f, 500.0f)) {
            if (sam3d_ss_flow_dit_forward(m,
                                          (const float *const *)lat, vel_u,
                                          zero_cond, ctx->cond_tokens.n,
                                          ts, d * TIME_SCALE, nthr) != 0) {
                fprintf(stderr, "[sam3d] ss_dit: uncond forward failed at step %d\n", s);
                free(times); free(zero_cond);
                for (int k = 0; k < SAM3D_SS_DIT_N_LATENTS; k++) {
                    free(lat[k]); free(vel[k]); free(vel_u[k]);
                }
                return -4;
            }
            for (int i = 0; i < SAM3D_SS_DIT_N_LATENTS; i++) {
                sam3d_shortcut_cfg_combine(vel[i], vel[i], vel_u[i],
                                           ctx->cfg.cfg_scale,
                                           sam3d_ss_lat_elts[i]);
            }
            cfg_steps++;
        }
        for (int i = 0; i < SAM3D_SS_DIT_N_LATENTS; i++)
            sam3d_shortcut_euler_step(lat[i], vel[i], dt, sam3d_ss_lat_elts[i]);
    }
    free(times); free(zero_cond);
    for (int i = 0; i < SAM3D_SS_DIT_N_LATENTS; i++) { free(vel[i]); free(vel_u[i]); }

    /* Persist shape latent as NCDHW [8,16,16,16] in ctx->ss_latent
     * (ready for the SS-VAE decoder). Source layout from DiT is [N=4096,C=8]. */
    ctx->ss_latent.ndim = 4;
    ctx->ss_latent.dims[0] = 8; ctx->ss_latent.dims[1] = 16;
    ctx->ss_latent.dims[2] = 16; ctx->ss_latent.dims[3] = 16;
    free(ctx->ss_latent.data);
    ctx->ss_latent.data = (float *)malloc((size_t)8 * 4096 * sizeof(float));
    if (!ctx->ss_latent.data) goto oom;
    for (int n = 0; n < 4096; n++)
        for (int c = 0; c < 8; c++)
            ctx->ss_latent.data[c * 4096 + n] = lat[SAM3D_SS_LAT_SHAPE][n * 8 + c];

    if (ctx->cfg.verbose) {
        float mn = ctx->ss_latent.data[0], mx = ctx->ss_latent.data[0];
        double sum = 0.0;
        for (int i = 0; i < 8 * 4096; i++) {
            float v = ctx->ss_latent.data[i];
            if (v < mn) mn = v;
            if (v > mx) mx = v;
            sum += v;
        }
        fprintf(stderr, "[sam3d] ss_dit: latent min=%.6g max=%.6g mean=%.6g d=%.3g rescale_t=3 reversed=0 cfg_steps=%d\n",
                mn, mx, sum / (8.0 * 4096.0), d, cfg_steps);
    }

    for (int i = 0; i < SAM3D_SS_DIT_N_LATENTS; i++) free(lat[i]);
    return 0;

oom:
    for (int i = 0; i < SAM3D_SS_DIT_N_LATENTS; i++) {
        free(lat[i]); free(vel[i]); free(vel_u[i]);
    }
    return -5;
}

int sam3d_run_ss_decode(sam3d_ctx *ctx)
{
    if (!ctx) return -1;
    if (!ctx->ss_latent.data) {
        fprintf(stderr, "[sam3d] ss_decode: ss_latent not set — run "
                        "sam3d_run_ss_dit() (or override) first\n");
        return -1;
    }
    if (ctx->ss_latent.ndim != 4 ||
        ctx->ss_latent.dims[0] != 8 ||
        ctx->ss_latent.dims[1] != 16 ||
        ctx->ss_latent.dims[2] != 16 ||
        ctx->ss_latent.dims[3] != 16) {
        fprintf(stderr, "[sam3d] ss_decode: expected [8,16,16,16], got "
                        "ndim=%d [%d,%d,%d,%d]\n",
                ctx->ss_latent.ndim,
                ctx->ss_latent.dims[0], ctx->ss_latent.dims[1],
                ctx->ss_latent.dims[2], ctx->ss_latent.dims[3]);
        return -2;
    }
    if (!ctx->ss_dec) {
        char path[1200];
        snprintf(path, sizeof(path), "%s/sam3d_ss_decoder.safetensors", ctx->sft_dir);
        ctx->ss_dec = t2_ss_dec_load(path);
        if (!ctx->ss_dec) {
            fprintf(stderr, "[sam3d] ss_decode: failed to load %s\n", path);
            return -3;
        }
    }
    float *logits = t2_ss_dec_forward(ctx->ss_dec, ctx->ss_latent.data,
                                       ctx->cfg.n_threads);
    if (!logits) return -4;

    f32_nd_free(&ctx->occupancy);
    ctx->occupancy.ndim = 3;
    ctx->occupancy.dims[0] = 64;
    ctx->occupancy.dims[1] = 64;
    ctx->occupancy.dims[2] = 64;
    ctx->occupancy.data = logits;   /* take ownership */
    if (ctx->cfg.verbose) {
        float mn = logits[0], mx = logits[0];
        double sum = 0.0;
        int pos = 0;
        for (int i = 0; i < 64 * 64 * 64; i++) {
            float v = logits[i];
            if (v < mn) mn = v;
            if (v > mx) mx = v;
            sum += v;
            pos += (v > 0.0f);
        }
        fprintf(stderr, "[sam3d] ss_decode: occupancy min=%.6g max=%.6g mean=%.6g pos=%d\n",
                mn, mx, sum / (64.0 * 64.0 * 64.0), pos);
    }
    return 0;
}

