lighttransport/gemm/cpu/sam3d/sam3d_runner.c
int sam3d_run_slat_dit(sam3d_ctx *ctx)
{
    if (!ctx) return -1;
    if (!ctx->occupancy.data) {
        fprintf(stderr, "[sam3d] slat_dit: occupancy not set — run "
                        "sam3d_run_ss_decode() (or override) first\n");
        return -1;
    }
    if (!ctx->cond_tokens.data) {
        fprintf(stderr, "[sam3d] slat_dit: cond tokens not set\n");
        return -1;
    }
    if (!ctx->slat_dit) {
        char path[1200];
        snprintf(path, sizeof(path), "%s/sam3d_slat_dit.safetensors", ctx->sft_dir);
        ctx->slat_dit = sam3d_slat_dit_load_safetensors(path);
        if (!ctx->slat_dit) {
            fprintf(stderr, "[sam3d] slat_dit: failed to load %s\n", path);
            return -3;
        }
    }
    sam3d_slat_dit_model *m = ctx->slat_dit;
    int nthr = ctx->cfg.n_threads;

    /* Voxel prune: argwhere(occ > 0). Grid is 64³ NCDHW [1,D,H,W] but we
     * stored it as 3D (D, H, W). Keep coords in (b,z,y,x) = (0,d,h,w). */
    int D = ctx->occupancy.dims[0];
    int H = ctx->occupancy.dims[1];
    int W = ctx->occupancy.dims[2];
    int cap = 0;
    for (int i = 0, n = D * H * W; i < n; i++)
        if (ctx->occupancy.data[i] > 0.0f) cap++;
    if (cap == 0) {
        fprintf(stderr, "[sam3d] slat_dit: occupancy is fully negative — "
                        "no voxels to decode\n");
        return -2;
    }

    int32_t *coords = (int32_t *)malloc((size_t)cap * 4 * sizeof(int32_t));
    float   *feats  = (float *)calloc((size_t)cap * m->in_channels, sizeof(float));
    if (!coords || !feats) { free(coords); free(feats); return -5; }

    int k = 0;
    for (int z = 0; z < D; z++)
        for (int y = 0; y < H; y++)
            for (int x = 0; x < W; x++)
                if (ctx->occupancy.data[(z * H + y) * W + x] > 0.0f) {
                    coords[k * 4 + 0] = 0;
                    coords[k * 4 + 1] = z;
                    coords[k * 4 + 2] = y;
                    coords[k * 4 + 3] = x;
                    k++;
                }

    /* Seeded Gaussian init for the SLAT latent tokens (x_T ~ N(0, I)). */
    uint64_t rng = (ctx->cfg.seed ^ 0x5851F42D4C957F2DULL);
    sam3d_fill_randn(feats, cap * m->in_channels, &rng);

    sp3d_tensor *x = sp3d_create(coords, feats, cap, m->in_channels, 1);
    if (!x) { free(coords); free(feats); return -5; }

    /* Flow-matching loop (strength=0 per yaml — no CFG on SLAT).
     * time_scale=1000 from slat_generator.yaml: upstream `_generate_dynamics`
     * multiplies t by time_scale before calling the model. */
    const float TIME_SCALE = 1000.0f;
    int steps = ctx->cfg.slat_steps;
    for (int s = 0; s < steps; s++) {
        float t = 1.0f - (float)s / (float)steps;
        if (sam3d_slat_dit_forward(m, &x, t * TIME_SCALE,
                                    ctx->cond_tokens.data, ctx->cond_tokens.n,
                                    nthr) != 0) {
            fprintf(stderr, "[sam3d] slat_dit: forward failed at step %d "
                            "(NOTE: forward is reserved for task #44 — "
                            "currently a stub)\n", s);
            sp3d_free(x); free(coords); free(feats);
            return -4;
        }
    }

    slat_free(&ctx->slat);
    ctx->slat.n = cap;
    ctx->slat.c = m->out_channels;
    ctx->slat.coords = (int32_t *)malloc((size_t)cap * 4 * sizeof(int32_t));
    ctx->slat.feats  = (float *)malloc((size_t)cap * m->out_channels * sizeof(float));
    if (!ctx->slat.coords || !ctx->slat.feats) {
        slat_free(&ctx->slat); sp3d_free(x); free(coords); free(feats);
        return -5;
    }
    memcpy(ctx->slat.coords, coords, (size_t)cap * 4 * sizeof(int32_t));
    memcpy(ctx->slat.feats,  x->feats,
           (size_t)cap * m->out_channels * sizeof(float));

    /* SLAT un-normalization: pytorch inference_pipeline does
     *   slat = slat * slat_std + slat_mean
     * between the flow DiT output and the GS decoder input. The stats are
     * 8-dim (one per feature channel) and live in pipeline.yaml; we hardcode
     * them here — they are fixed for the shipped sam-3d-objects checkpoint. */
    static const float SLAT_MEAN[8] = {
         0.12211431f,  0.37204156f, -1.26521907f, -2.05276058f,
        -3.10432536f, -0.11294304f, -0.85146744f,  0.45506954f,
    };
    static const float SLAT_STD[8] = {
         2.37326008f,  2.13174402f,  2.2413953f,   2.30589401f,
         2.1191894f,   1.8969511f,   2.41684989f,  2.08374642f,
    };
    if (m->out_channels == 8) {
        int C = m->out_channels;
        for (int i = 0; i < cap; i++) {
            float *r = ctx->slat.feats + (size_t)i * C;
            for (int c = 0; c < C; c++) r[c] = r[c] * SLAT_STD[c] + SLAT_MEAN[c];
        }
    }

    sp3d_free(x); free(coords); free(feats);
    return 0;
}

/* log(softplus(x)) computed stably across the full x range.
 *   x →  +∞ : softplus(x) ≈ x              →  log ≈ log(x)
 *   x →  0  : softplus(x) = log1p(e^x)     →  log of that
 *   x → -∞ : softplus(x) ≈ e^x             →  log ≈ x
 * `logf(1 + expf(x))` underflows when expf(x) is below fp32
 * ULP-at-1 (~1e-7); `log1pf` stays accurate for small arguments. */
static float sam3d_log_softplus(float x) {
    if (x >  20.0f) return logf(x);
    if (x < -15.0f) return x;
    return logf(log1pf(expf(x)));
}

int sam3d_run_slat_gs_decode(sam3d_ctx *ctx)
{
    if (!ctx || !ctx->slat.feats || !ctx->slat.coords) {
        fprintf(stderr, "[sam3d] slat_gs_decode: SLAT tokens not set — run "
                        "sam3d_run_slat_dit() (or override) first\n");
        return -1;
    }

    if (!ctx->gs_decoder) {
        char path[1200];
        snprintf(path, sizeof(path), "%s/sam3d_slat_gs_decoder.safetensors",
                 ctx->sft_dir);
        ctx->gs_decoder = sam3d_gs_decoder_load_safetensors(path);
        if (!ctx->gs_decoder) {
            fprintf(stderr, "[sam3d] slat_gs_decode: failed to load %s\n", path);
            return -3;
        }
    }
    sam3d_gs_decoder_model *m = ctx->gs_decoder;
    int N = ctx->slat.n;
    int G = m->num_gaussians;
    int total = N * G;
    int nthr = ctx->cfg.n_threads;

    sp3d_tensor *x = sp3d_create(ctx->slat.coords, ctx->slat.feats,
                                  N, ctx->slat.c, 1);
    if (!x) return -5;

    float *out_feats = NULL;
    if (sam3d_gs_decoder_transformer(m, x, &out_feats, nthr) != 0) {
        sp3d_free(x);
        return -4;
    }

