lighttransport/gemm/cpu/sam3d/sam3d_runner.c
    float *xyz = (float *)malloc((size_t)total * 3 * sizeof(float));
    float *dc  = (float *)malloc((size_t)total * 3 * sizeof(float));
    float *scl = (float *)malloc((size_t)total * 3 * sizeof(float));
    float *rot = (float *)malloc((size_t)total * 4 * sizeof(float));
    float *op  = (float *)malloc((size_t)total     * sizeof(float));
    if (!xyz || !dc || !scl || !rot || !op) {
        free(xyz); free(dc); free(scl); free(rot); free(op);
        free(out_feats); sp3d_free(x);
        return -5;
    }
    sam3d_gs_decoder_to_representation(m, ctx->slat.coords, out_feats, N,
                                        xyz, dc, scl, rot, op);
    free(out_feats);
    sp3d_free(x);

    if (f32_2d_alloc(&ctx->gaussians, total, SAM3D_GS_STRIDE) != 0) {
        free(xyz); free(dc); free(scl); free(rot); free(op);
        return -5;
    }

    /* Convert raw representation to INRIA-PLY storage convention:
     *   opacity → raw + opacity_bias                 (pre-sigmoid logit)
     *   scale   → log(softplus(raw + inv_softplus(scaling_bias)))
     * Rotation/xyz/f_dc pass through unchanged. */
    const float inv_sp_sb = logf(expf(m->scaling_bias) - 1.0f);
    for (int i = 0; i < total; i++) {
        float *row = ctx->gaussians.data + (size_t)i * SAM3D_GS_STRIDE;
        row[0] = xyz[i * 3 + 0];
        row[1] = xyz[i * 3 + 1];
        row[2] = xyz[i * 3 + 2];
        row[3] = row[4] = row[5] = 0.0f;         /* normals */
        row[6] = dc[i * 3 + 0];
        row[7] = dc[i * 3 + 1];
        row[8] = dc[i * 3 + 2];
        row[9] = op[i] + m->opacity_bias;
        for (int a = 0; a < 3; a++) {
            row[10 + a] = sam3d_log_softplus(scl[i * 3 + a] + inv_sp_sb);
        }
        row[13] = rot[i * 4 + 0];
        row[14] = rot[i * 4 + 1];
        row[15] = rot[i * 4 + 2];
        row[16] = rot[i * 4 + 3];
    }

    free(xyz); free(dc); free(scl); free(rot); free(op);
    return 0;
}

/* ---- Accessors ---- */

static int copy_2d(const f32_2d *src, float *out, int *on, int *oc) {
    if (!src->data) return -1;
    if (on) *on = src->n;
    if (oc) *oc = src->c;
    if (out) memcpy(out, src->data, (size_t)src->n * src->c * sizeof(float));
    return 0;
}
static int copy_nd(const f32_nd *src, float *out, int *odims) {
    if (!src->data) return -1;
    size_t total = 1;
    for (int i = 0; i < src->ndim; i++) {
        if (odims) odims[i] = src->dims[i];
        total *= (size_t)src->dims[i];
    }
    if (out) memcpy(out, src->data, total * sizeof(float));
    return 0;
}

int sam3d_get_dinov2_tokens(sam3d_ctx *ctx, float *o, int *n, int *c)
    { return copy_2d(&ctx->dinov2_tokens, o, n, c); }
int sam3d_get_cond_tokens(sam3d_ctx *ctx, float *o, int *n, int *c)
    { return copy_2d(&ctx->cond_tokens, o, n, c); }
int sam3d_get_ss_latent(sam3d_ctx *ctx, float *o, int *dims)
    { return copy_nd(&ctx->ss_latent, o, dims); }
int sam3d_get_occupancy(sam3d_ctx *ctx, float *o, int *dims)
    { return copy_nd(&ctx->occupancy, o, dims); }

int sam3d_get_slat_tokens(sam3d_ctx *ctx, float *of, int32_t *oc,
                          int *on, int *oc_dim)
{
    if (!ctx->slat.feats) return -1;
    if (on) *on = ctx->slat.n;
    if (oc_dim) *oc_dim = ctx->slat.c;
    if (of) memcpy(of, ctx->slat.feats,
                   (size_t)ctx->slat.n * ctx->slat.c * sizeof(float));
    if (oc) memcpy(oc, ctx->slat.coords,
                   (size_t)ctx->slat.n * 4 * sizeof(int32_t));
    return 0;
}

int sam3d_get_gaussians(sam3d_ctx *ctx, float *o, int *n)
{
    if (!ctx->gaussians.data) return -1;
    if (n) *n = ctx->gaussians.n;
    if (o) memcpy(o, ctx->gaussians.data,
                  (size_t)ctx->gaussians.n * ctx->gaussians.c * sizeof(float));
    return 0;
}

/* ---- Debug overrides ---- */

static int set_2d(f32_2d *dst, const float *src, int n, int c) {
    free(dst->data);
    dst->data = (float *)malloc((size_t)n * c * sizeof(float));
    if (!dst->data) return -1;
    memcpy(dst->data, src, (size_t)n * c * sizeof(float));
    dst->n = n; dst->c = c;
    return 0;
}
static int set_nd(f32_nd *dst, const float *src, const int *dims, int ndim) {
    free(dst->data);
    size_t total = 1;
    for (int i = 0; i < ndim; i++) { dst->dims[i] = dims[i]; total *= (size_t)dims[i]; }
    dst->ndim = ndim;
    dst->data = (float *)malloc(total * sizeof(float));
    if (!dst->data) return -1;
    memcpy(dst->data, src, total * sizeof(float));
    return 0;
}

int sam3d_debug_override_dinov2(sam3d_ctx *ctx, const float *t, int n, int c)
    { return set_2d(&ctx->dinov2_tokens, t, n, c); }
int sam3d_debug_override_cond(sam3d_ctx *ctx, const float *t, int n, int c)
    { return set_2d(&ctx->cond_tokens, t, n, c); }
int sam3d_debug_override_ss_latent(sam3d_ctx *ctx, const float *l, const int *dims)
    { return set_nd(&ctx->ss_latent, l, dims, 4); }
int sam3d_debug_override_occupancy(sam3d_ctx *ctx, const float *o, const int *dims)
    { return set_nd(&ctx->occupancy, o, dims, 3); }
int sam3d_debug_override_slat(sam3d_ctx *ctx, const float *f,
                              const int32_t *co, int n, int c)
{
    slat_free(&ctx->slat);
    ctx->slat.feats = (float *)malloc((size_t)n * c * sizeof(float));
    ctx->slat.coords = (int32_t *)malloc((size_t)n * 4 * sizeof(int32_t));
    if (!ctx->slat.feats || !ctx->slat.coords) return -1;
    memcpy(ctx->slat.feats, f, (size_t)n * c * sizeof(float));
    memcpy(ctx->slat.coords, co, (size_t)n * 4 * sizeof(int32_t));
    ctx->slat.n = n; ctx->slat.c = c;
    return 0;
}
